Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.WallTypeUnsupportedError
The selected wall type/shape isn't supported for attaching a wall to a stair. To continue, detach the wall from the stairs' components.

Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.StairsComponentTypeUnsupportedError
The selected stair type/shape isn't supported for attaching a wall to a stair. To continue, detach the wall from the stairs' components.